# Prot_GetLicenseID

## Description
Returns the license id.

```pascal
FUNCTION Prot_GetLicenseID : STRING;
```

```python

def vs.Prot_GetLicenseID():
    return STRING
```

## Version
Availability: from Vectorworks 2023
## Category
* Protection